sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
################################################################################
#
# Written by James Sleeman, http://sparks.gogo.co.nz/
#
#  ATtiny Series Microcontrollers
#
#   ATtiny4,  ATtiny9              (6 pin)
#   ATtiny5,  ATtiny10             (6 pin)
#   ATtiny13, ATtiny13A            (8 pin)
#   ATtiny25, ATtiny45, ATtiny85   (8 pin)
#   ATtiny24, ATtiny44, ATtiny84   (14 pin)
#
#
#  FUSE AND LOCK BIT NOTE - READ BEFORE YOU GET CONFUSES
#  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  When reading in fuses and lock bits from the chip avrdude *sometimes* masks
#  out the bits which are unused, and sets them to 0, other times it doesn't.
#  
#  For chips where it does, if you write for example 0xFC (11111100)
#  avrdude decides to mask the top two bits, then it will read in OX3C (00111100)
#  which means that it will fail when it tries to verify.  So in that case you 
#  need to provide the already-masked byte when you write the lock/fuse so that
#  avrdude won't complain.
#
#  But not all chips are configured this way.
#
#  You can see the masking of the lock/fuse, or not, by looking in avrdude.conf
#  for the appropriate section (t85 in this case, and look for the read 
#  specification for the efuse section, the last 8 bits on the 2nd line
#  are "x" for a mask and "o" for not masked, so if the last 8 are are all "o"
#  in the read section for a fuse then no masking is used.
#
#  Do not rely on the engbedded.com fuse calculator to tell you this, it's not
#  always correct, probably because it depends heavily on the avrdude.conf you 
#  are using at any given time.
#
################################################################################

# Note that there is an invisible zero-width non-breaking space character after 
# each menu title to differentiate it from the diy_atmega8 menus which have the
# same names without that if you have both atmega8 and attiny installed then the 
# menu ordering will be the atmega8 ordering.

menu.version    = Processor Version 
menu.clock      = Processor Speed 
menu.boot       = Use Bootloader 
menu.core       = Millis, Tone Support 
menu.millis_ppm = Millis Accuracy 
menu.print      = Print Support 
menu.serial     = Serial Support 
menu.lto        = Link Time Optimisation 
menu.bodlevel   = Brown-out Detection Level 
menu.advclk     = Override Clock Source 
menu.advfrq     = Override Frequency 
menu.advups     = Override Upload Speed 

# The names are put here in the order they will appear in the boards menu
#  you can repeat these definitions in each board section for completeness
#  it doesn't appear to matter.

attiny4_diy.name=ATtiny4
attiny5_diy.name=ATtiny5
attiny9_diy.name=ATtiny9
attiny10_diy.name=ATtiny10
attiny13_diy.name=ATtiny13
attiny24_diy.name=ATtiny24
attiny44_diy.name=ATtiny44
attiny84_diy.name=ATtiny84
attiny25_diy.name=ATtiny25
attiny45_diy.name=ATtiny45
attiny85_diy.name=ATtiny85

################################################################################
# ATtiny25, ATtiny45, ATtiny85
#
# Note, there is no bootloader section, so we can not do any locking.
#
# avrdude.conf note
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# The avrdude.conf supplied with the Arduino IDE does not include support for
# reading the lock bits, so it would fail to verify. Hence why a new avrdude.conf
# is supplied in this boards config.  Sigh.
#
# Lock Buts Note
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  avrdude DOES NOT mask the lock bits on the x5, therefore
#
#    0xFF = No Locking
#    0xFE = Read Locking
#    0xFC = Read and Write Locking
#
# Extended Fuses Note
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  avrdude DOES NOT mask the extended fuses on the x5, the engbedded.com 
#  calulator's suggestion for alternative efuse settings is incorrect.
#
#
################################################################################

# {{{ ############### ATtiny25 #################################################

attiny25_diy.name=ATtiny25
attiny25_diy.build.mcu=attiny25
attiny25_diy.bootloader.low_fuses=0xE2
# attiny25_diy.bootloader.high_fuses=0xDD
attiny25_diy.bootloader.bod_bits=101
attiny25_diy.bootloader.high_fuses=0b11011{bootloader.bod_bits}
attiny25_diy.bootloader.extended_fuses=0xFF
attiny25_diy.bootloader.unlock_bits=0xFF
attiny25_diy.bootloader.lock_bits=0xFF
attiny25_diy.build.f_cpu=8000000L
attiny25_diy.upload.speed=57600
attiny25_diy.build.core=tiny
attiny25_diy.build.variant=tiny8
attiny25_diy.build.board=ATTINY25_DIY
attiny25_diy.upload.tool=diy_attiny:avrdude
attiny25_diy.bootloader.tool=diy_attiny:avrdude
attiny25_diy.upload.maximum_data_size=128

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# No sense having this menu until there is another version
# attiny25_diy.menu.version.attiny25 = ATtiny25
# attiny25_diy.menu.version.attiny25.build.mcu = attiny25

# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny25_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
attiny25_diy.menu.boot.optiboot.upload.protocol=arduino
attiny25_diy.menu.boot.optiboot.upload.maximum_size=1490
attiny25_diy.menu.boot.optiboot.bootloader.extended_fuses=0xFE
attiny25_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex
attiny25_diy.menu.boot.optiboot.bootloader.noblink=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny25_diy.menu.boot.optiboot_notune=Yes, Without Tuner
attiny25_diy.menu.boot.optiboot_notune.upload.protocol=arduino
attiny25_diy.menu.boot.optiboot_notune.upload.maximum_size=1504
attiny25_diy.menu.boot.optiboot_notune.bootloader.extended_fuses=0xFE
attiny25_diy.menu.boot.optiboot_notune.bootloader.file=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

