sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny45_diy.menu.bodlevel.2v7=2.7v
attiny45_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
attiny45_diy.menu.bodlevel.disabled=Disabled
attiny45_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
attiny45_diy.menu.bodlevel.4v3=4.3v
attiny45_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
attiny45_diy.menu.bodlevel.1v8=1.8v
attiny45_diy.menu.bodlevel.1v8.bootloader.bod_bits=110

# Override: Clock Source Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny45_diy.menu.advclk.auto=Default

attiny45_diy.menu.advclk.x16=Internal Oscillator 16 MHz (PLL)
attiny45_diy.menu.advclk.x16.bootloader.low_fuses=0xF1
attiny45_diy.menu.advclk.x16.build.f_cpu=16000000L

attiny45_diy.menu.advclk.i8=Internal Oscillator 8 MHz
attiny45_diy.menu.advclk.i8.bootloader.low_fuses=0xE2
attiny45_diy.menu.advclk.i8.build.f_cpu=8000000L

attiny45_diy.menu.advclk.i64=Internal Oscillator 6.4 MHz
attiny45_diy.menu.advclk.i64.bootloader.low_fuses=0xD3
attiny45_diy.menu.advclk.i64.build.f_cpu=6400000L

attiny45_diy.menu.advclk.i1=Internal Oscillator 1 MHz
attiny45_diy.menu.advclk.i1.bootloader.low_fuses=0x62
attiny45_diy.menu.advclk.i1.build.f_cpu=1000000L

attiny45_diy.menu.advclk.i128=Internal Oscillator 128 kHz (WDT)
attiny45_diy.menu.advclk.i128.bootloader.low_fuses=0xE4
attiny45_diy.menu.advclk.i128.build.f_cpu=128000L

attiny45_diy.menu.advclk.xlf=Low Frequency Crystal/Resonator
attiny45_diy.menu.advclk.xlf.bootloader.low_fuses=0xE6

attiny45_diy.menu.advclk.x400=Crystal/Resonator 400-900 kHz
attiny45_diy.menu.advclk.x400.bootloader.low_fuses=0xF9

attiny45_diy.menu.advclk.x900=Crystal/Resonator 900 kHz - 3 MHz
attiny45_diy.menu.advclk.x900.bootloader.low_fuses=0xFB

attiny45_diy.menu.advclk.x3=Crystal/Resonator 3-8 MHz
attiny45_diy.menu.advclk.x3.bootloader.low_fuses=0xFD

attiny45_diy.menu.advclk.x8=Crystal/Resonator 8 MHz +
attiny45_diy.menu.advclk.x8.bootloader.low_fuses=0xFF

attiny45_diy.menu.advclk.xc=External Clock (TCXO, OCXO...)
attiny45_diy.menu.advclk.xc.bootloader.low_fuses=0xE0

# Override: Frequency Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny45_diy.menu.advfrq.auto=Default

attiny45_diy.menu.advfrq.32k768=32.768 kHz
attiny45_diy.menu.advfrq.32k768.build.f_cpu=32768L
attiny45_diy.menu.advfrq.32k768.upload.speed=150

attiny45_diy.menu.advfrq.128k=128 kHz
attiny45_diy.menu.advfrq.128k.build.f_cpu=128000L
attiny45_diy.menu.advfrq.128k.upload.speed=300

attiny45_diy.menu.advfrq.1M=1 MHz
attiny45_diy.menu.advfrq.1M.build.f_cpu=1000000L
attiny45_diy.menu.advfrq.1M.upload.speed=9600

attiny45_diy.menu.advfrq.2M=2 MHz
attiny45_diy.menu.advfrq.2M.build.f_cpu=2000000L
attiny45_diy.menu.advfrq.2M.upload.speed=19200

attiny45_diy.menu.advfrq.4M=4 MHz
attiny45_diy.menu.advfrq.4M.build.f_cpu=4000000L
attiny45_diy.menu.advfrq.4M.upload.speed=38400

attiny45_diy.menu.advfrq.4M608=4.608 MHz
attiny45_diy.menu.advfrq.4M608.build.f_cpu=4608000L
attiny45_diy.menu.advfrq.4M608.upload.speed=115200

attiny45_diy.menu.advfrq.4M8=4.8 MHz
attiny45_diy.menu.advfrq.4M8.build.f_cpu=4800000L
attiny45_diy.menu.advfrq.4M8.upload.speed=19200

attiny45_diy.menu.advfrq.6M=6 MHz
attiny45_diy.menu.advfrq.6M.build.f_cpu=6000000L
attiny45_diy.menu.advfrq.6M.upload.speed=57600

attiny45_diy.menu.advfrq.6M4=6.4 MHz
attiny45_diy.menu.advfrq.6M4.build.f_cpu=6400000L
attiny45_diy.menu.advfrq.6M4.upload.speed=115200

attiny45_diy.menu.advfrq.8M=8 MHz
attiny45_diy.menu.advfrq.8M.build.f_cpu=8000000L
attiny45_diy.menu.advfrq.8M.upload.speed=38400

attiny45_diy.menu.advfrq.9M6=9.6 MHz
attiny45_diy.menu.advfrq.9M6.build.f_cpu=9600000L
attiny45_diy.menu.advfrq.9M6.upload.speed=57600

attiny45_diy.menu.advfrq.10M=10 MHz
attiny45_diy.menu.advfrq.10M.build.f_cpu=10000000L
attiny45_diy.menu.advfrq.10M.upload.speed=115200

attiny45_diy.menu.advfrq.12M=12 MHz
attiny45_diy.menu.advfrq.12M.build.f_cpu=12000000L
attiny45_diy.menu.advfrq.12M.upload.speed=115200

attiny45_diy.menu.advfrq.12M8=12.8 MHz
attiny45_diy.menu.advfrq.12M8.build.f_cpu=12800000L
attiny45_diy.menu.advfrq.12M8.upload.speed=115200

attiny45_diy.menu.advfrq.15M36=15.36 MHz
attiny45_diy.menu.advfrq.15M36.build.f_cpu=15360000L
attiny45_diy.menu.advfrq.15M36.upload.speed=57600

attiny45_diy.menu.advfrq.16M=16 MHz
attiny45_diy.menu.advfrq.16M.build.f_cpu=16000000L
attiny45_diy.menu.advfrq.16M.upload.speed=57600

attiny45_diy.menu.advfrq.19M2=19.2 MHz
attiny45_diy.menu.advfrq.19M2.build.f_cpu=19200000L
attiny45_diy.menu.advfrq.19M2.upload.speed=115200

attiny45_diy.menu.advfrq.20M=20 MHz
attiny45_diy.menu.advfrq.20M.build.f_cpu=20000000L
attiny45_diy.menu.advfrq.20M.upload.speed=115200

attiny45_diy.menu.advfrq.24M=24 MHz
attiny45_diy.menu.advfrq.24M.build.f_cpu=24000000L
attiny45_diy.menu.advfrq.24M.upload.speed=115200

# Override: Upload Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny45_diy.menu.advups.auto=Default

attiny45_diy.menu.advups.115200=115200
attiny45_diy.menu.advups.115200.upload.speed=115200

attiny45_diy.menu.advups.57600=57600
attiny45_diy.menu.advups.57600.upload.speed=57600

attiny45_diy.menu.advups.38400=38400
attiny45_diy.menu.advups.38400.upload.speed=38400

attiny45_diy.menu.advups.19200=19200
attiny45_diy.menu.advups.19200.upload.speed=19200

attiny45_diy.menu.advups.9600=9600
attiny45_diy.menu.advups.9600.upload.speed=9600

attiny45_diy.menu.advups.2400=2400
attiny45_diy.menu.advups.2400.upload.speed=2400

attiny45_diy.menu.advups.1200=1200
attiny45_diy.menu.advups.1200.upload.speed=1200

attiny45_diy.menu.advups.300=300
attiny45_diy.menu.advups.300.upload.speed=300

attiny45_diy.menu.advups.150=150
attiny45_diy.menu.advups.150.upload.speed=150

# }}}

# {{{ ############### ATtiny85 #################################################

attiny85_diy.name=ATtiny85
attiny85_diy.build.mcu=attiny85
attiny85_diy.bootloader.low_fuses=0xE2
# attiny85_diy.bootloader.high_fuses=0xDD
attiny85_diy.bootloader.bod_bits=101
attiny85_diy.bootloader.high_fuses=0b11011{bootloader.bod_bits}
attiny85_diy.bootloader.extended_fuses=0xFF
attiny85_diy.bootloader.unlock_bits=0xFF
attiny85_diy.bootloader.lock_bits=0xFF
attiny85_diy.build.f_cpu=8000000L
attiny85_diy.upload.speed=57600
attiny85_diy.build.core=tiny
attiny85_diy.build.variant=tiny8
attiny85_diy.build.board=ATTINY85_DIY
attiny85_diy.upload.tool=diy_attiny:avrdude
attiny85_diy.bootloader.tool=diy_attiny:avrdude
attiny85_diy.upload.maximum_data_size=512

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# No sense having this menu, until there is another version
# attiny85_diy.menu.version.attiny85 = ATtiny85
# attiny85_diy.menu.version.attiny85.build.mcu = attiny85

