sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny44_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny44_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny44_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny44_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny44_diy.menu.lto.enable=LTO Enabled
attiny44_diy.menu.lto.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny44_diy.menu.lto.enable.ltoelfflags=-g -flto -DLTO_ENABLED -fuse-linker-plugin
attiny44_diy.menu.lto.enable.ltocppflags=-flto -DLTO_ENABLED
attiny44_diy.menu.lto.enable.ltoarcmd=gcc-
attiny44_diy.menu.lto.disable=LTO Disabled
attiny44_diy.menu.lto.disable.ltocflags=
attiny44_diy.menu.lto.disable.ltoelfflags=
attiny44_diy.menu.lto.disable.ltocppflags=
attiny44_diy.menu.lto.disable.ltoarcmd=

# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny44_diy.menu.bodlevel.2v7=2.7v
attiny44_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
attiny44_diy.menu.bodlevel.disabled=Disabled
attiny44_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
attiny44_diy.menu.bodlevel.4v3=4.3v
attiny44_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
attiny44_diy.menu.bodlevel.1v8=1.8v
attiny44_diy.menu.bodlevel.1v8.bootloader.bod_bits=110

# The ones below are not mentioned in the 24/44/84 or 24/44/84A 
# datasheets but at least engbedded includes for 24A/44[A]/84
# so they might work, but can't say for sure.
#
# attiny44_diy.menu.bodlevel.2v3=2.3v
# attiny44_diy.menu.bodlevel.2v3.bootloader.bod_bits=011
# attiny44_diy.menu.bodlevel.2v2=2.2v
# attiny44_diy.menu.bodlevel.2v2.bootloader.bod_bits=010
# attiny44_diy.menu.bodlevel.2v0=2.0v
# attiny44_diy.menu.bodlevel.2v0.bootloader.bod_bits=000
# attiny44_diy.menu.bodlevel.1v9=1.9v
# attiny44_diy.menu.bodlevel.1v9.bootloader.bod_bits=001

# Override: Clock Source Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny44_diy.menu.advclk.auto=Default

attiny44_diy.menu.advclk.i8=Internal Oscillator 8 MHz
attiny44_diy.menu.advclk.i8.bootloader.low_fuses=0xE2
attiny44_diy.menu.advclk.i8.build.f_cpu=8000000L

attiny44_diy.menu.advclk.i1=Internal Oscillator 1 MHz
attiny44_diy.menu.advclk.i1.bootloader.low_fuses=0x62
attiny44_diy.menu.advclk.i1.build.f_cpu=1000000L

attiny44_diy.menu.advclk.i128=Internal Oscillator 128 kHz (WDT)
attiny44_diy.menu.advclk.i128.bootloader.low_fuses=0xE4
attiny44_diy.menu.advclk.i128.build.f_cpu=128000L

attiny44_diy.menu.advclk.xlf=Low Frequency Crystal/Resonator
attiny44_diy.menu.advclk.xlf.bootloader.low_fuses=0xE6

attiny44_diy.menu.advclk.x400=Crystal/Resonator 400-900 kHz
attiny44_diy.menu.advclk.x400.bootloader.low_fuses=0xF9

attiny44_diy.menu.advclk.x900=Crystal/Resonator 900 kHz - 3 MHz
attiny44_diy.menu.advclk.x900.bootloader.low_fuses=0xFB

attiny44_diy.menu.advclk.x3=Crystal/Resonator 3-8 MHz
attiny44_diy.menu.advclk.x3.bootloader.low_fuses=0xFD

attiny44_diy.menu.advclk.x8=Crystal/Resonator 8 MHz +
attiny44_diy.menu.advclk.x8.bootloader.low_fuses=0xFF

attiny44_diy.menu.advclk.xc=External Clock (TCXO, OCXO...)
attiny44_diy.menu.advclk.xc.bootloader.low_fuses=0xE0

# Override: Frequency Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny44_diy.menu.advfrq.auto=Default

attiny44_diy.menu.advfrq.32k768=32.768 kHz
attiny44_diy.menu.advfrq.32k768.build.f_cpu=32768L
attiny44_diy.menu.advfrq.32k768.upload.speed=150

attiny44_diy.menu.advfrq.128k=128 kHz
attiny44_diy.menu.advfrq.128k.build.f_cpu=128000L
attiny44_diy.menu.advfrq.128k.upload.speed=300

attiny44_diy.menu.advfrq.1M=1 MHz
attiny44_diy.menu.advfrq.1M.build.f_cpu=1000000L
attiny44_diy.menu.advfrq.1M.upload.speed=9600

attiny44_diy.menu.advfrq.2M=2 MHz
attiny44_diy.menu.advfrq.2M.build.f_cpu=2000000L
attiny44_diy.menu.advfrq.2M.upload.speed=19200

attiny44_diy.menu.advfrq.4M=4 MHz
attiny44_diy.menu.advfrq.4M.build.f_cpu=4000000L
attiny44_diy.menu.advfrq.4M.upload.speed=38400

attiny44_diy.menu.advfrq.4M608=4.608 MHz
attiny44_diy.menu.advfrq.4M608.build.f_cpu=4608000L
attiny44_diy.menu.advfrq.4M608.upload.speed=115200

attiny44_diy.menu.advfrq.4M8=4.8 MHz
attiny44_diy.menu.advfrq.4M8.build.f_cpu=4800000L
attiny44_diy.menu.advfrq.4M8.upload.speed=19200

attiny44_diy.menu.advfrq.6M=6 MHz
attiny44_diy.menu.advfrq.6M.build.f_cpu=6000000L
attiny44_diy.menu.advfrq.6M.upload.speed=57600

attiny44_diy.menu.advfrq.6M4=6.4 MHz
attiny44_diy.menu.advfrq.6M4.build.f_cpu=6400000L
attiny44_diy.menu.advfrq.6M4.upload.speed=115200

attiny44_diy.menu.advfrq.8M=8 MHz
attiny44_diy.menu.advfrq.8M.build.f_cpu=8000000L
attiny44_diy.menu.advfrq.8M.upload.speed=38400

attiny44_diy.menu.advfrq.9M6=9.6 MHz
attiny44_diy.menu.advfrq.9M6.build.f_cpu=9600000L
attiny44_diy.menu.advfrq.9M6.upload.speed=57600

attiny44_diy.menu.advfrq.10M=10 MHz
attiny44_diy.menu.advfrq.10M.build.f_cpu=10000000L
attiny44_diy.menu.advfrq.10M.upload.speed=115200

attiny44_diy.menu.advfrq.12M=12 MHz
attiny44_diy.menu.advfrq.12M.build.f_cpu=12000000L
attiny44_diy.menu.advfrq.12M.upload.speed=115200

attiny44_diy.menu.advfrq.12M8=12.8 MHz
attiny44_diy.menu.advfrq.12M8.build.f_cpu=12800000L
attiny44_diy.menu.advfrq.12M8.upload.speed=115200

attiny44_diy.menu.advfrq.15M36=15.36 MHz
attiny44_diy.menu.advfrq.15M36.build.f_cpu=15360000L
attiny44_diy.menu.advfrq.15M36.upload.speed=57600

attiny44_diy.menu.advfrq.16M=16 MHz
attiny44_diy.menu.advfrq.16M.build.f_cpu=16000000L
attiny44_diy.menu.advfrq.16M.upload.speed=57600

attiny44_diy.menu.advfrq.19M2=19.2 MHz
attiny44_diy.menu.advfrq.19M2.build.f_cpu=19200000L
attiny44_diy.menu.advfrq.19M2.upload.speed=115200

attiny44_diy.menu.advfrq.20M=20 MHz
attiny44_diy.menu.advfrq.20M.build.f_cpu=20000000L
attiny44_diy.menu.advfrq.20M.upload.speed=115200

attiny44_diy.menu.advfrq.24M=24 MHz
attiny44_diy.menu.advfrq.24M.build.f_cpu=24000000L
attiny44_diy.menu.advfrq.24M.upload.speed=115200

