sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny13_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny13_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny13_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny13_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny13_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny13_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny13_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny13_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL






# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny13_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny13_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny13_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny13_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny13_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny13_diy.menu.print.Dec=Dec Only Supported
attiny13_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny13_diy.menu.print.Hex=Hex Only Supported
attiny13_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny13_diy.menu.print.Oct=Oct Only Supported
attiny13_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny13_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny13_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

# Serial Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.serial.HalfDuplexRW=Half Duplex, Read+Write
attiny13_diy.menu.serial.HalfDuplexRW.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX

attiny13_diy.menu.serial.HalfDuplexRWStream=Half Duplex, Read+Write Inherits Stream
attiny13_diy.menu.serial.HalfDuplexRWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny13_diy.menu.serial.HalfDuplexRStream=Half Duplex, Read Only Inherits Stream
attiny13_diy.menu.serial.HalfDuplexRStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_WRITE -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny13_diy.menu.serial.HalfDuplexWStream=Half Duplex, Write Only Inherits Stream
attiny13_diy.menu.serial.HalfDuplexWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_READ

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.lto.enable=LTO Enabled
attiny13_diy.menu.lto.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny13_diy.menu.lto.enable.ltoelfflags=-g -flto -DLTO_ENABLED -fuse-linker-plugin
attiny13_diy.menu.lto.enable.ltocppflags=-flto -DLTO_ENABLED
attiny13_diy.menu.lto.enable.ltoarcmd=gcc-
attiny13_diy.menu.lto.disable=LTO Disabled
attiny13_diy.menu.lto.disable.ltocflags=
attiny13_diy.menu.lto.disable.ltoelfflags=
attiny13_diy.menu.lto.disable.ltocppflags=
attiny13_diy.menu.lto.disable.ltoarcmd=

# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.bodlevel.2v7=2.7v
attiny13_diy.menu.bodlevel.2v7.bootloader.bod_bits=01
attiny13_diy.menu.bodlevel.disabled=Disabled
attiny13_diy.menu.bodlevel.disabled.bootloader.bod_bits=11
attiny13_diy.menu.bodlevel.1v8=1.8v
attiny13_diy.menu.bodlevel.1v8.bootloader.bod_bits=10
attiny13_diy.menu.bodlevel.4v3=4.3v
attiny13_diy.menu.bodlevel.4v3.bootloader.bod_bits=00

# Override: Clock Source Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny13_diy.menu.advclk.auto=Default

attiny13_diy.menu.advclk.i9M6=Internal Oscillator 9.6 MHz
attiny13_diy.menu.advclk.i9M6.bootloader.low_fuses=0x7A
attiny13_diy.menu.advclk.i9M6.build.f_cpu=9600000L
attiny13_diy.menu.advclk.i9M6.upload.speed=57600

attiny13_diy.menu.advclk.i1M2=Internal Oscillator 1.2 MHz
attiny13_diy.menu.advclk.i1M2.bootloader.low_fuses=0x6A
attiny13_diy.menu.advclk.i1M2.build.f_cpu=1200000L
attiny13_diy.menu.advclk.i1M2.upload.speed=2400

attiny13_diy.menu.advclk.i4M8=Internal Oscillator 4.8 MHz
attiny13_diy.menu.advclk.i4M8.bootloader.low_fuses=0x79
attiny13_diy.menu.advclk.i4M8.build.f_cpu=4800000L
attiny13_diy.menu.advclk.i4M8.upload.speed=19200

attiny13_diy.menu.advclk.i600K=Internal Oscillator 600 kHz
attiny13_diy.menu.advclk.i600K.bootloader.low_fuses=0x69
attiny13_diy.menu.advclk.i600K.build.f_cpu=600000L
attiny13_diy.menu.advclk.i600K.upload.speed=2400

attiny13_diy.menu.advclk.i128K=Internal Oscillator 128 kHz
attiny13_diy.menu.advclk.i128K.bootloader.low_fuses=0x7B
attiny13_diy.menu.advclk.i128K.build.f_cpu=128000L
attiny13_diy.menu.advclk.i128K.upload.speed=300

attiny13_diy.menu.advclk.xc=External Clock (TCXO, OCXO...)
attiny13_diy.menu.advclk.xc.bootloader.low_fuses=0x78

# Override: Frequency Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny13_diy.menu.advfrq.auto=Default

attiny13_diy.menu.advfrq.32k768=32.768 kHz
attiny13_diy.menu.advfrq.32k768.build.f_cpu=32768L
attiny13_diy.menu.advfrq.32k768.upload.speed=150

attiny13_diy.menu.advfrq.128k=128 kHz
attiny13_diy.menu.advfrq.128k.build.f_cpu=128000L
attiny13_diy.menu.advfrq.128k.upload.speed=300

attiny13_diy.menu.advfrq.600k=600 kHz
attiny13_diy.menu.advfrq.600k.build.f_cpu=600000L
attiny13_diy.menu.advfrq.600k.upload.speed=2400

attiny13_diy.menu.advfrq.1M=1 MHz
attiny13_diy.menu.advfrq.1M.build.f_cpu=1000000L
attiny13_diy.menu.advfrq.1M.upload.speed=9600

attiny13_diy.menu.advfrq.1M2=1.2 MHz
attiny13_diy.menu.advfrq.1M2.build.f_cpu=1200000L
attiny13_diy.menu.advfrq.1M2.upload.speed=2400

