sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny13_diy.menu.advfrq.2M=2 MHz
attiny13_diy.menu.advfrq.2M.build.f_cpu=2000000L
attiny13_diy.menu.advfrq.2M.upload.speed=19200

attiny13_diy.menu.advfrq.4M=4 MHz
attiny13_diy.menu.advfrq.4M.build.f_cpu=4000000L
attiny13_diy.menu.advfrq.4M.upload.speed=38400

attiny13_diy.menu.advfrq.4M608=4.608 MHz
attiny13_diy.menu.advfrq.4M608.build.f_cpu=4608000L
attiny13_diy.menu.advfrq.4M608.upload.speed=115200

attiny13_diy.menu.advfrq.4M8=4.8 MHz
attiny13_diy.menu.advfrq.4M8.build.f_cpu=4800000L
attiny13_diy.menu.advfrq.4M8.upload.speed=19200

attiny13_diy.menu.advfrq.6M=6 MHz
attiny13_diy.menu.advfrq.6M.build.f_cpu=6000000L
attiny13_diy.menu.advfrq.6M.upload.speed=57600

attiny13_diy.menu.advfrq.6M4=6.4 MHz
attiny13_diy.menu.advfrq.6M4.build.f_cpu=6400000L
attiny13_diy.menu.advfrq.6M4.upload.speed=115200

attiny13_diy.menu.advfrq.8M=8 MHz
attiny13_diy.menu.advfrq.8M.build.f_cpu=8000000L
attiny13_diy.menu.advfrq.8M.upload.speed=38400

attiny13_diy.menu.advfrq.9M6=9.6 MHz
attiny13_diy.menu.advfrq.9M6.build.f_cpu=9600000L
attiny13_diy.menu.advfrq.9M6.upload.speed=57600

attiny13_diy.menu.advfrq.10M=10 MHz
attiny13_diy.menu.advfrq.10M.build.f_cpu=10000000L
attiny13_diy.menu.advfrq.10M.upload.speed=115200

attiny13_diy.menu.advfrq.12M=12 MHz
attiny13_diy.menu.advfrq.12M.build.f_cpu=12000000L
attiny13_diy.menu.advfrq.12M.upload.speed=115200

attiny13_diy.menu.advfrq.12M8=12.8 MHz
attiny13_diy.menu.advfrq.12M8.build.f_cpu=12800000L
attiny13_diy.menu.advfrq.12M8.upload.speed=115200

attiny13_diy.menu.advfrq.15M36=15.36 MHz
attiny13_diy.menu.advfrq.15M36.build.f_cpu=15360000L
attiny13_diy.menu.advfrq.15M36.upload.speed=57600

attiny13_diy.menu.advfrq.16M=16 MHz
attiny13_diy.menu.advfrq.16M.build.f_cpu=16000000L
attiny13_diy.menu.advfrq.16M.upload.speed=57600

attiny13_diy.menu.advfrq.19M2=19.2 MHz
attiny13_diy.menu.advfrq.19M2.build.f_cpu=19200000L
attiny13_diy.menu.advfrq.19M2.upload.speed=115200

attiny13_diy.menu.advfrq.20M=20 MHz
attiny13_diy.menu.advfrq.20M.build.f_cpu=20000000L
attiny13_diy.menu.advfrq.20M.upload.speed=115200

attiny13_diy.menu.advfrq.24M=24 MHz
attiny13_diy.menu.advfrq.24M.build.f_cpu=24000000L
attiny13_diy.menu.advfrq.24M.upload.speed=115200

# Override: Upload Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

#attiny13_diy.menu.advups.auto=Default

#attiny13_diy.menu.advups.115200=115200
#attiny13_diy.menu.advups.115200.upload.speed=115200

#attiny13_diy.menu.advups.57600=57600
#attiny13_diy.menu.advups.57600.upload.speed=57600

#attiny13_diy.menu.advups.38400=38400
#attiny13_diy.menu.advups.38400.upload.speed=38400

#attiny13_diy.menu.advups.19200=19200
#attiny13_diy.menu.advups.19200.upload.speed=19200

#attiny13_diy.menu.advups.9600=9600
#attiny13_diy.menu.advups.9600.upload.speed=9600

#attiny13_diy.menu.advups.2400=2400
#attiny13_diy.menu.advups.2400.upload.speed=2400

#attiny13_diy.menu.advups.1200=1200
#attiny13_diy.menu.advups.1200.upload.speed=1200

#attiny13_diy.menu.advups.300=300
#attiny13_diy.menu.advups.300.upload.speed=300

#attiny13_diy.menu.advups.150=150
#attiny13_diy.menu.advups.150.upload.speed=150

# }}}





################################################################################
# ATtiny4
#
# There is only 1 fuse on this series of chips, it really doesn't do much.
#
# Fuse
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 154 of Datasheet
#
#   avrdude DOES NOT mask the fuse bits
#
#   0xFF = Default (Reset Enabled, WDT Not Always On, Clock Not Output)
#
# Lock Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 153 of Datasheet
#
#  avrdude DOES NOT mask the lock bits
#
#    0xFF = No Locking
#    0xFE = Write Locked
#    0xFC = Read and Write Locked
#
# Important: Lock bits must be set after setting the fuse.
#
################################################################################

# {{{ ############### ATtiny4 ##################################################

attiny4_diy.name=ATtiny4
attiny4_diy.build.mcu=attiny4
attiny4_diy.bootloader.fuse=0xFF
attiny4_diy.bootloader.unlock_bits=0xFF
attiny4_diy.bootloader.lock_bits=0xFF
attiny4_diy.build.f_cpu=8000000L
attiny4_diy.upload.speed=57600
attiny4_diy.build.core=tiny
attiny4_diy.build.variant=tiny4_9
attiny4_diy.build.board=ATTINY4_DIY
attiny4_diy.upload.tool=diy_attiny:avrdude_nobootloader_onefuse
attiny4_diy.bootloader.tool=diy_attiny:avrdude_nobootloader_onefuse
attiny4_diy.upload.maximum_data_size=32

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Only one version, no sense including this menu
# attiny4_diy.menu.version.attiny4 = ATtiny4
# attiny4_diy.menu.version.attiny4.build.mcu = attiny4

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# The frequency on the Reduced Core tinyAVR is set at runtime by way of a 
# prescaler (power of 2) on the internal 8MHz oscillator.
#
# See pins_arduino.h setCPUFrequency()

attiny4_diy.menu.clock.8MHz=8MHz
attiny4_diy.menu.clock.8MHz.build.f_cpu=8000000L

attiny4_diy.menu.clock.4MHz=4MHz
attiny4_diy.menu.clock.4MHz.build.f_cpu=4000000L

attiny4_diy.menu.clock.2MHz=2MHz
attiny4_diy.menu.clock.2MHz.build.f_cpu=2000000L

attiny4_diy.menu.clock.1MHz=1MHz
attiny4_diy.menu.clock.1MHz.build.f_cpu=1000000L

# These frequencies under 1MHz need some work
#  something is wrong with delayMicroSecondsAdjusted, running too fast
#  could be a memory issue maybe.

# attiny4_diy.menu.clock.500kHz=500kHz
# attiny4_diy.menu.clock.500kHz.build.f_cpu=500000L

# attiny4_diy.menu.clock.250kHz=250kHz
# attiny4_diy.menu.clock.250kHz.build.f_cpu=250000L

# attiny4_diy.menu.clock.125kHz=125kHz
# attiny4_diy.menu.clock.125kHz.build.f_cpu=125000L


# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Sorry attiny4, you're too small for bootloaders.
#
# attiny4_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
# attiny4_diy.menu.boot.optiboot.upload.protocol=arduino
# attiny4_diy.menu.boot.optiboot.upload.maximum_size=457
# attiny4_diy.menu.boot.optiboot.bootloader.extended_fuses=0xEB
# attiny4_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex
# attiny4_diy.menu.boot.optiboot.bootloader.noblink=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny4_diy.menu.boot.none=No (TPI Programmer Upload)
attiny4_diy.menu.boot.none.upload.maximum_size=512
attiny4_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader_onefuse

# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#attiny4_diy.menu.core.FullCore=Millis and Tone Available
#attiny4_diy.menu.core.FullCore.build.core=tiny
#attiny4_diy.menu.core.FullCore.build.extra_flags=

